---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.InvalidFabricationPartType
enum: Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult
source: html/7f028cdc-ad5f-a349-b3e7-8c7d2e65ded0.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.InvalidFabricationPartType

Failed because there was an invalid Fabrication part type identifier or an identifier that did not exist in the mappings.